constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;
solver solidBodyDisplacementLaplacian;
diffusivity quadratic inversePointDistance (Hole1 Hole2);

interpolation patchCorrected
(
    (Hole1 Hole2)
    (Border Inlet Outlet)
);

solidBodyMotionFunction  rotatingMotion;
origin        (0 0 0);
axis          (0 0 1);
omega               5;


// ************************************************************************* //

