0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
	"Border|Inlet|Outlet"
	{
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
	}
	
	Hole1
	{
		type            movingWallVelocity;
        value           uniform (0 0 0);
	}


	Hole2
	{
		type            movingWallVelocity;
        value           uniform (0 0 0);
	}
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
