0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       pointVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{

"Border|Inlet|Outlet"
{
    type            fixedValue;
    value           $internalField;
}

Hole1
{
    type                     solidBodyMotionDisplacement;
    solidBodyMotionFunction  oscillatingRotatingMotion;
    origin                   (-0.25 0.000 0);
    amplitude                (0 0 25);  // degs
    omega                    5;
}


Hole2
{
    type                     solidBodyMotionDisplacement;
    solidBodyMotionFunction  oscillatingRotatingMotion;
    origin                   (0.25 0.000 0);
    amplitude                (0 0 -25);  // degs
    omega                           5;
}

}


// ************************************************************************* //
